app/views/flats/new.html.erb

      </div>
      <h2>Building: <%= @building.name %>, <%= @building.localities.first.name %></h2>
---
SELECT "localities".* FROM "localities" INNER JOIN "locations" ON "localities"."id" = "locations"."locality_id" WHERE "locations"."building_id" = 9 LIMIT 1