app/views/flats/new_property.html.erb

SELECT "localities".* FROM "localities" INNER JOIN "locations" ON "localities"."id" = "locations"."locality_id" WHERE "locations"."building_id" = 4 LIMIT 1
---
          <% else %>
              <h2>Building: <%= @building.name %>, <%= @building.localities.first.name %></h2>