app/controllers/buildings_controller.rb

  def new

    @buildings=Building.all
    @localities=Locality.all
---
SELECT "localities".* FROM "localities"