app/controllers/flats_controller.rb

  def new_property
    @buildings=Building.all
    @localities=Locality.all
    @furnstats=Furnstat.all
    @sources=Source.all

    if params[:building_id]
      @building=Building.find(params[:building_id])
    else
      @building = Building.new
    end
    @building.locations.build
    @building.build_address
    @flat = @building.flats.build

    @flat.build_bhk_config
    @flat.build_flat_key_datum

    @bhks=Bhk.all
---
SELECT "localities".* FROM "localities"
SELECT "furnstats".* FROM "furnstats"
SELECT "sources".* FROM "sources"
SELECT "bhks".* FROM "bhks"

  def new

    @flat = Flat.new
    @building=Building.find(params[:building_id])


    @flat.build_bhk_config
    @bhks=Bhk.all
---
SELECT "bhks".* FROM "bhks"

  def edit
    @flat = Flat.find(params[:id])
    @bhks=Bhk.all
---
SELECT "bhks".* FROM "bhks"